org/regular-expression.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-05-21 Thu 15:59>
#+TITLE: Regular Expression

本文内容以 [[https://www.softwhy.com/article-339-1.html][蚂蚁部落·正则表达式]] 为基础进行摘录、扩展，仅供学习。

** 简介

正则表达式，是一种规则，匹配字符串的规则，为进一步操作匹配的结果做准备。它的应用非常广泛，如实现站点的本地化搜索和 RSS 订阅。

它的功能很强大（强而繁），但一般情况下用到的却比较简单，所以不要试图一下子就完全掌握它，前期只需要了解基本概念和常用操作，其它在使用的过程中不断地深入即可。

** 创建

如何创建一个正则表达式呢？ _字面量方式_ 和 _RegExp 构造函数方式_ 。

#+BEGIN_SRC js -n
  // 字面量
  let reg0 = /\bant/
  let reg1 = /\bant/g             // g 为修饰符

  // 构造函数
  // - 参数1 ，普通字符串或正则表达式
  // - 参数2 ，可选，修饰符

  // 第一个参数是字符串，必须符合正则表达式规则！
  let reg2 = new RegExp('\\bant')
  let reg3 = new RegExp('\\bant', 'g')
  let reg4 = new RegExp('ant')
  let reg5 = new RegExp('ant', 'g')

  // 第一个参数是正则表达式
  let reg6 = new RegExp(/\b\w/gi)
#+END_SRC

为什么是 =new RegExp('\\bant')= 中要使用两个 =\\= 呢？先思考一下，将在转义字符中说明。

由于上述这个问题，推荐使用字面量方式创建正则表达式。

** 方法

为了方便后续地了解，我们行介绍一下正则表达式相关的几个方法。

*** test()

此方法可以检测一个字符串是否匹配某个模式，匹配成功返回 =true= ，否则返回 =false= 。

语法结构：

#+BEGIN_EXAMPLE
  RegExpObject.test(string)       // string 必需，要检测的字符串
#+END_EXAMPLE

实例代码：

#+BEGIN_SRC js -n
  let str = 'I love antzone'

  let reg0 = /\d/
  console.log(reg0.test(str))      // → false

  let reg1 = /\w/
  console.log(reg1.test(str))      // → true
#+END_SRC

*** exec()

此方法可以 检索字符串中与正则表达式匹配的内容，返回一个存放匹配内容的数组。

语法结构：

#+BEGIN_EXAMPLE
  RegExpObject.exec(string)       // string 必需，要检索的字符串
#+END_EXAMPLE

实例代码：

#+BEGIN_SRC js -n
  let str = 'antzone'

  let reg0 = /n/
  console.log(reg0.exec(str))
  // →  ["n", index: 1, input: "antzone", groups: undefined]
  // - 成功完成一次匹配，并返回一个数组；
  // - 数组第一个元素是正则表达式匹配内容；
  // - index 属性返回匹配内容的在原字符串的起始位置
  // - input 属性返回 str 原字符串

  let reg1 = /n/g
  console.log(reg1.exec(str))
  // →  ["n", "n", index: 1, input: "antzone", groups: undefined]

  let reg2 = /(n)(t)/
  console.log(reg2.exec(str))
  // →  ["nt", "n", "t", index: 1, input: "antzone", groups: undefined]
  // - 数组第一个元素是正则表达式匹配内容；
  // - 数组第二个元素是第一个子表达式匹配到的内容，
  // - 第三个元素是第二个子表达式匹配到的内容，以此类推。
#+END_SRC

** 正则相关字符方法

***  search()

该方法用于检索字符串中指定的子字符串（普通字符串或正则表达式），检索到则返回子字符串在字符串中的位置，否则返回 -1 。

语法结构：

#+BEGIN_EXAMPLE
  str.search(searchValue)         // searchValue 必需，要检索的子字符串
  // or
  str.search(regexp)
#+END_EXAMPLE

实例代码：

#+BEGIN_SRC js -n
  let str0 = '本站的url地址是www.softwhy.com'
  let str1 = '蚂蚁部落'

  let reg = /\w+/g
  console.log(str0.search(reg))    // → 3
  console.log(str1.search(reg))    // → -1
#+END_SRC

