public/regular-expression.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-21 Thu 21:05 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Regular Expression</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Regular Expression</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgafbc022">简介</a></li>
<li><a href="#orgbda4952">创建</a></li>
<li><a href="#orgc7315f0">方法</a>
<ul>
<li><a href="#org6e8bbff">test()</a></li>
<li><a href="#orgb75b996">exec()</a></li>
</ul>
</li>
<li><a href="#org6b4744c">正则相关字符方法</a>
<ul>
<li><a href="#org8c1ffa0">search()</a></li>
<li><a href="#org8abe0b3">match()</a></li>
<li><a href="#org5f715f9">replace()</a></li>
<li><a href="#org5932384">split()</a></li>
</ul>
</li>
<li><a href="#orgc656578">元字符</a></li>
<li><a href="#org5d206bd">量词</a></li>
<li><a href="#org805aa5d">修饰符</a></li>
<li><a href="#org8d3cd34">分组和选择项</a></li>
<li><a href="#org9a5f332">贪婪匹配和惰性匹配</a></li>
</ul>
</div>
</div>
<p>
本文内容以 <a href="https://www.softwhy.com/article-339-1.html">蚂蚁部落·正则表达式</a> 为基础进行摘录、扩展，仅供学习。
</p>

<div id="outline-container-orgafbc022" class="outline-2">
<h2 id="orgafbc022">简介</h2>
<div class="outline-text-2" id="text-orgafbc022">
<p>
正则表达式，是一种规则，匹配字符串的规则，为进一步操作匹配的结果做准备。它的应用非常广泛，如实现站点的本地化搜索和 RSS 订阅。
</p>

<p>
它的功能很强大（强而繁），但一般情况下用到的却比较简单，所以不要试图一下子就完全掌握它，前期只需要了解基本概念和常用操作，其它在使用的过程中不断地深入即可。
</p>
</div>
</div>

<div id="outline-container-orgbda4952" class="outline-2">
<h2 id="orgbda4952">创建</h2>
<div class="outline-text-2" id="text-orgbda4952">
<p>
如何创建一个正则表达式呢？ <span class="underline">字面量方式</span> 和 <span class="underline">RegExp 构造函数方式</span> 。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#23383;&#38754;&#37327;</span>
<span class="linenr"> 2: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg0</span> = <span style="color: #CDC673;">/\bant/</span>
<span class="linenr"> 3: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg1</span> = <span style="color: #CDC673;">/\bant/</span>g             <span style="color: #8B8878;">// </span><span style="color: #8B8878;">g &#20026;&#20462;&#39280;&#31526;</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#26500;&#36896;&#20989;&#25968;</span>
<span class="linenr"> 6: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">- &#21442;&#25968;1 &#65292;&#26222;&#36890;&#23383;&#31526;&#20018;&#25110;&#27491;&#21017;&#34920;&#36798;&#24335;</span>
<span class="linenr"> 7: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">- &#21442;&#25968;2 &#65292;&#21487;&#36873;&#65292;&#20462;&#39280;&#31526;</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#31532;&#19968;&#20010;&#21442;&#25968;&#26159;&#23383;&#31526;&#20018;&#65292;&#24517;&#39035;&#31526;&#21512;&#27491;&#21017;&#34920;&#36798;&#24335;&#35268;&#21017;&#65281;</span>
<span class="linenr">10: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg2</span> = <span style="color: #FF1493;">new</span> <span style="color: #5FD7FF;">RegExp</span><span style="color: #AF87FF;">(</span><span style="color: #CDC673;">'\\bant'</span><span style="color: #AF87FF;">)</span>
<span class="linenr">11: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg3</span> = <span style="color: #FF1493;">new</span> <span style="color: #5FD7FF;">RegExp</span><span style="color: #AF87FF;">(</span><span style="color: #CDC673;">'\\bant'</span>, <span style="color: #CDC673;">'g'</span><span style="color: #AF87FF;">)</span>
<span class="linenr">12: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg4</span> = <span style="color: #FF1493;">new</span> <span style="color: #5FD7FF;">RegExp</span><span style="color: #AF87FF;">(</span><span style="color: #CDC673;">'ant'</span><span style="color: #AF87FF;">)</span>
<span class="linenr">13: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg5</span> = <span style="color: #FF1493;">new</span> <span style="color: #5FD7FF;">RegExp</span><span style="color: #AF87FF;">(</span><span style="color: #CDC673;">'ant'</span>, <span style="color: #CDC673;">'g'</span><span style="color: #AF87FF;">)</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#31532;&#19968;&#20010;&#21442;&#25968;&#26159;&#27491;&#21017;&#34920;&#36798;&#24335;</span>
<span class="linenr">16: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg6</span> = <span style="color: #FF1493;">new</span> <span style="color: #5FD7FF;">RegExp</span><span style="color: #AF87FF;">(</span><span style="color: #CDC673;">/\b\w/</span>gi<span style="color: #AF87FF;">)</span>
</pre>
</div>

<p>
为什么是 <code>new RegExp('\\bant')</code> 中要使用两个 <code>\\</code> 呢？先思考一下，将在转义字符中说明。
</p>

<p>
由于上述这个问题，推荐使用字面量方式创建正则表达式。
</p>
</div>
</div>

<div id="outline-container-orgc7315f0" class="outline-2">
<h2 id="orgc7315f0">方法</h2>
<div class="outline-text-2" id="text-orgc7315f0">
<p>
为了方便后续地了解，我们行介绍一下正则表达式相关的几个方法。
</p>
</div>

<div id="outline-container-org6e8bbff" class="outline-3">
<h3 id="org6e8bbff">test()</h3>
<div class="outline-text-3" id="text-org6e8bbff">
<p>
此方法可以检测一个字符串是否匹配某个模式，匹配成功返回 <code>true</code> ，否则返回 <code>false</code> 。
</p>

<p>
语法结构：
</p>

<pre class="example">
RegExpObject.test(string)       // string 必需，要检测的字符串
</pre>

<p>
实例代码：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">str</span> = <span style="color: #CDC673;">'I love antzone'</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg0</span> = <span style="color: #CDC673;">/\d/</span>
<span class="linenr">4: </span>console.log<span style="color: #AF87FF;">(</span>reg0.test<span style="color: #5FD7FF;">(</span>str<span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span>      <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; false</span>
<span class="linenr">5: </span>
<span class="linenr">6: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg1</span> = <span style="color: #CDC673;">/\w/</span>
<span class="linenr">7: </span>console.log<span style="color: #AF87FF;">(</span>reg1.test<span style="color: #5FD7FF;">(</span>str<span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span>      <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; true</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb75b996" class="outline-3">
<h3 id="orgb75b996">exec()</h3>
<div class="outline-text-3" id="text-orgb75b996">
<p>
此方法可以 检索字符串中与正则表达式匹配的内容，返回一个存放匹配内容的数组。
</p>

<p>
语法结构：
</p>

<pre class="example">
RegExpObject.exec(string)       // string 必需，要检索的字符串
</pre>

<p>
实例代码：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">str</span> = <span style="color: #CDC673;">'antzone'</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg0</span> = <span style="color: #CDC673;">/n/</span>
<span class="linenr"> 4: </span>console.log<span style="color: #AF87FF;">(</span>reg0.exec<span style="color: #5FD7FF;">(</span>str<span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span>
<span class="linenr"> 5: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594;  ["n", index: 1, input: "antzone", groups: undefined]</span>
<span class="linenr"> 6: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">- &#25104;&#21151;&#23436;&#25104;&#19968;&#27425;&#21305;&#37197;&#65292;&#24182;&#36820;&#22238;&#19968;&#20010;&#25968;&#32452;&#65307;</span>
<span class="linenr"> 7: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">- &#25968;&#32452;&#31532;&#19968;&#20010;&#20803;&#32032;&#26159;&#27491;&#21017;&#34920;&#36798;&#24335;&#21305;&#37197;&#20869;&#23481;&#65307;</span>
<span class="linenr"> 8: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">- index &#23646;&#24615;&#36820;&#22238;&#21305;&#37197;&#20869;&#23481;&#30340;&#22312;&#21407;&#23383;&#31526;&#20018;&#30340;&#36215;&#22987;&#20301;&#32622;</span>
<span class="linenr"> 9: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">- input &#23646;&#24615;&#36820;&#22238; str &#21407;&#23383;&#31526;&#20018;</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg1</span> = <span style="color: #CDC673;">/n/</span>g
<span class="linenr">12: </span>console.log<span style="color: #AF87FF;">(</span>reg1.exec<span style="color: #5FD7FF;">(</span>str<span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span>
<span class="linenr">13: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594;  ["n", "n", index: 1, input: "antzone", groups: undefined]</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg2</span> = <span style="color: #CDC673;">/(n)(t)/</span>
<span class="linenr">16: </span>console.log<span style="color: #AF87FF;">(</span>reg2.exec<span style="color: #5FD7FF;">(</span>str<span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span>
<span class="linenr">17: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594;  ["nt", "n", "t", index: 1, input: "antzone", groups: undefined]</span>
<span class="linenr">18: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">- &#25968;&#32452;&#31532;&#19968;&#20010;&#20803;&#32032;&#26159;&#27491;&#21017;&#34920;&#36798;&#24335;&#21305;&#37197;&#20869;&#23481;&#65307;</span>
<span class="linenr">19: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">- &#25968;&#32452;&#31532;&#20108;&#20010;&#20803;&#32032;&#26159;&#31532;&#19968;&#20010;&#23376;&#34920;&#36798;&#24335;&#21305;&#37197;&#21040;&#30340;&#20869;&#23481;&#65292;</span>
<span class="linenr">20: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">- &#31532;&#19977;&#20010;&#20803;&#32032;&#26159;&#31532;&#20108;&#20010;&#23376;&#34920;&#36798;&#24335;&#21305;&#37197;&#21040;&#30340;&#20869;&#23481;&#65292;&#20197;&#27492;&#31867;&#25512;&#12290;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6b4744c" class="outline-2">
<h2 id="org6b4744c">正则相关字符方法</h2>
<div class="outline-text-2" id="text-org6b4744c">
</div>
<div id="outline-container-org8c1ffa0" class="outline-3">
<h3 id="org8c1ffa0">search()</h3>
<div class="outline-text-3" id="text-org8c1ffa0">
<p>
该方法用于检索字符串中指定的子字符串（普通字符串或正则表达式），检索到则返回子字符串在字符串中的位置，否则返回 -1 。
</p>

<p>
语法结构：
</p>

<pre class="example">
str.search(searchValue)         // searchValue 必需，要检索的子字符串
// or
str.search(regexp)
</pre>

<p>
实例代码：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">str0</span> = <span style="color: #CDC673;">'&#26412;&#31449;&#30340;url&#22320;&#22336;&#26159;www.softwhy.com'</span>
<span class="linenr">2: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">str1</span> = <span style="color: #CDC673;">'&#34434;&#34433;&#37096;&#33853;'</span>
<span class="linenr">3: </span>
<span class="linenr">4: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg</span> = <span style="color: #CDC673;">/\w+/</span>g
<span class="linenr">5: </span>console.log<span style="color: #AF87FF;">(</span>str0.search<span style="color: #5FD7FF;">(</span>reg<span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; 3</span>
<span class="linenr">6: </span>console.log<span style="color: #AF87FF;">(</span>str1.search<span style="color: #5FD7FF;">(</span>reg<span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; -1</span>
</pre>
</div>
</div>
</div>
