org/regular-expression.org
*** match()

该方法可以在字符串内查找一个或多个与指定正则表达式匹配的子字符串，返回存放着匹配结果的数组，否则返回 =null= 。

语法结构：

#+BEGIN_EXAMPLE
  stringObject.match(reg)
#+END_EXAMPLE

具体结果参数和 [[*exec()][exec() ↑]] 类似，它们在全局匹配的时候有区别，暂略。

*** replace()

该方法可以用指定字符串替换源字符串的指定内容，返回替换后产生的新字符串，不会修改源字符串。

语法结构：

#+BEGIN_EXAMPLE
  str.replace(oldStr, newStr)
  // or
  str.replace(regexp, replacement)
  // - regexp 必需，正则表达式，用于在源字符串中检索将要被替换的内容；
  // - replcement 必需，规定用于替换的内容，可以是字符串、正则相关的特殊值和函数。
#+END_EXAMPLE

实例代码：

#+BEGIN_SRC js -n
  let str = 'ant8zone'

  let reg = /\d/
  console.log(str.replace(reg, 'H')) // → antHzone
#+END_SRC

我们稍微看一下当 =repacement= 为具特殊意义的美元 =$= 符号时：
- =$1、$2、...$99= ：分别对应正则表达式第一个到第九九个子表达式匹配的内容；
- =$&= ：正则表达式匹配的字符串。

#+BEGIN_SRC js -n
  let str0 = 'ant,zone'
  let newStr0 = str.replace(/(\w+),(\w+)/, '$2 $1')
  console.log(newStr0)            // → zone ant

  let str1 = 'ant88'
  let newStr1 = str.replace(/\d+/, '$1$&')
  console.log(newStr)             // → ant8888
  // $1 为第一个表达式匹配的内容 88
  // $$ 则是正则表达式匹配的内容 88
  // $1$$ 就是 8888 ，用 8888 替换字符中的 88 ，结果自然是 ant8888
#+END_SRC

*** split()

该方法能够对字符串进行划分，并生成一个数组。

语法结构：

#+BEGIN_EXAMPLE
  str.split(separator, limit)
  // - separator ，可选，规定用于分割字符串的子字符串
  // - limit ，可选，设定字符被分割的次数
  // or
  str.split(reg, howmany)
  // - reg ，必需，正则表达式
  // - howmany ，可选，规定生成数组的长度
#+END_EXAMPLE

实例代码：

#+BEGIN_SRC js -n
  let str0 = 'antzone'
  console.log(str0.split(/n/))
  // → ["a", "tzo", "e"]

  let str1 = 'softwhy is good webSite'
  console.log(str1.split(/\s/))    // → ["softwhy", "is", "good", "webSite"]
  console.log(str1.split(/\s/), 2) // → ["softwhy", "is"]

  let st2 = 'ant'
  // \w可以匹配到字符串中的每一个字符，字符两端是空
  console.log(str.split(/\w/))    // → ["", "", "", ""]
  // 如果正则表达式包含子表达式，那么返回的数组中包括与这些子表达式匹配的字串
  console.log(str.split(/(\w)/))  // → ["", "a", "", "n", "", "t", ""]
#+END_SRC

** 元字符

正则表达式是具有一定规则的字符串，组成正则的字符串可以有普通的字符，也可以有特殊字符（元字符）。

正则表达式的元字符从形成基本可以分为两大类：
- 本身就有特殊意义，比如 =^、$、.= 等；
- 通过转义字符使其具有特殊意义，如 =\w、\d= 等。

#+CAPTION: 元字符
| 元字符 | 结构   | 描述                                                     |
|--------+--------+----------------------------------------------------------|
| =.=    | =/.+/= | 匹配除回车符 =\r= 和换行符 =\n= 外的任意字符             |
| =^=    | =/^x/= | 匹配字符串的起始位置                                     |
| =$=    | =/x$/= | 匹配字符串的结尾                                         |
| =\w=   | =/\w/= | 匹配单词字符，等价于 =[a-zA-Z0-9]=                       |
| =\W=   | =/\W/= | 匹配非字母数字，等价于 =[^a-zA-Z0-9]=                    |
| =\d=   | =/\d/= | 匹配单个数字字符，等价于 =[0-9]=                         |
| =\D=   | =/\D/= | 匹配非数字字符，等价于 =[^0-9]=                          |
| =\s=   | =/\s/= | 匹配空白字符                                             |
| =\S=   | =/\S/= | 匹配非空白字符                                           |
| =\b=   | =/\b/= | 匹配字符的边界，即匹配的是一个位置，而不是一个真正的字符 |
| =\B=   | =/\B/= | 匹配非单词边界                                           |
| =\0=   | =/\0/= | 即 =null= ，等价于 =\u0000=                              |

其余有： =\n \f \r \t \v \xxx \xnn \uxxxx= 。

** 量词

| 字符      | 结构         | 描述                                         |
|-----------+--------------+----------------------------------------------|
| =+=       | =/x+/=       | 可以重复匹配前面匹配的字符 1 次或多次        |
| =*=       | =/x*/=       | 可以重复匹配前面匹配的字符 0 次或多次        |
| =?=       | =x?=         | 可以匹配前面匹配的字符 0 次或 1 次           |
| ={n}=     | =/x{n}/=     | 可以重复前面匹配的内容 n 次                  |
| ={n, m}=  | =/x{n, m}/=  | 重复前一项匹配至少 n 次，但是不能够超过 m 次 |
| ={n,}=    | =/x{n,}/=    | 匹配前一项 n 次或者更多次                    |
| =*?=      | =/x*?/=      |                                              |
| =+?=      | =/x+?/=      |                                              |
| =??=      | =/x??/=      |                                              |
| ={n, m}?= | =/x{n, m}?/= |                                              |
| ={n,}?=   | =/x{n,}?/=   |                                              |

