public/regular-expression.html

<div id="outline-container-org8abe0b3" class="outline-3">
<h3 id="org8abe0b3">match()</h3>
<div class="outline-text-3" id="text-org8abe0b3">
<p>
该方法可以在字符串内查找一个或多个与指定正则表达式匹配的子字符串，返回存放着匹配结果的数组，否则返回 <code>null</code> 。
</p>

<p>
语法结构：
</p>

<pre class="example">
stringObject.match(reg)
</pre>

<p>
具体结果参数和 <a href="#orgb75b996">exec() ↑</a> 类似，它们在全局匹配的时候有区别，暂略。
</p>
</div>
</div>

<div id="outline-container-org5f715f9" class="outline-3">
<h3 id="org5f715f9">replace()</h3>
<div class="outline-text-3" id="text-org5f715f9">
<p>
该方法可以用指定字符串替换源字符串的指定内容，返回替换后产生的新字符串，不会修改源字符串。
</p>

<p>
语法结构：
</p>

<pre class="example">
str.replace(oldStr, newStr)
// or
str.replace(regexp, replacement)
// - regexp 必需，正则表达式，用于在源字符串中检索将要被替换的内容；
// - replcement 必需，规定用于替换的内容，可以是字符串、正则相关的特殊值和函数。
</pre>

<p>
实例代码：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">str</span> = <span style="color: #CDC673;">'ant8zone'</span>
<span class="linenr">2: </span>
<span class="linenr">3: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">reg</span> = <span style="color: #CDC673;">/\d/</span>
<span class="linenr">4: </span>console.log<span style="color: #AF87FF;">(</span>str.replace<span style="color: #5FD7FF;">(</span>reg, <span style="color: #CDC673;">'H'</span><span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span> <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; antHzone</span>
</pre>
</div>

<p>
我们稍微看一下当 <code>repacement</code> 为具特殊意义的美元 <code>$</code> 符号时：
</p>
<ul class="org-ul">
<li><code>$1、$2、...$99</code> ：分别对应正则表达式第一个到第九九个子表达式匹配的内容；</li>
<li><code>$&amp;</code> ：正则表达式匹配的字符串。</li>
</ul>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">str0</span> = <span style="color: #CDC673;">'ant,zone'</span>
<span class="linenr"> 2: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">newStr0</span> = str.replace<span style="color: #AF87FF;">(</span><span style="color: #CDC673;">/(\w+),(\w+)/</span>, <span style="color: #CDC673;">'$2 $1'</span><span style="color: #AF87FF;">)</span>
<span class="linenr"> 3: </span>console.log<span style="color: #AF87FF;">(</span>newStr0<span style="color: #AF87FF;">)</span>            <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; zone ant</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">str1</span> = <span style="color: #CDC673;">'ant88'</span>
<span class="linenr"> 6: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">newStr1</span> = str.replace<span style="color: #AF87FF;">(</span><span style="color: #CDC673;">/\d+/</span>, <span style="color: #CDC673;">'$1$&amp;'</span><span style="color: #AF87FF;">)</span>
<span class="linenr"> 7: </span>console.log<span style="color: #AF87FF;">(</span>newStr<span style="color: #AF87FF;">)</span>             <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; ant8888</span>
<span class="linenr"> 8: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">$1 &#20026;&#31532;&#19968;&#20010;&#34920;&#36798;&#24335;&#21305;&#37197;&#30340;&#20869;&#23481; 88</span>
<span class="linenr"> 9: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">$$ &#21017;&#26159;&#27491;&#21017;&#34920;&#36798;&#24335;&#21305;&#37197;&#30340;&#20869;&#23481; 88</span>
<span class="linenr">10: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">$1$$ &#23601;&#26159; 8888 &#65292;&#29992; 8888 &#26367;&#25442;&#23383;&#31526;&#20013;&#30340; 88 &#65292;&#32467;&#26524;&#33258;&#28982;&#26159; ant8888</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5932384" class="outline-3">
<h3 id="org5932384">split()</h3>
<div class="outline-text-3" id="text-org5932384">
<p>
该方法能够对字符串进行划分，并生成一个数组。
</p>

<p>
语法结构：
</p>

<pre class="example">
str.split(separator, limit)
// - separator ，可选，规定用于分割字符串的子字符串
// - limit ，可选，设定字符被分割的次数
// or
str.split(reg, howmany)
// - reg ，必需，正则表达式
// - howmany ，可选，规定生成数组的长度
</pre>

<p>
实例代码：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">str0</span> = <span style="color: #CDC673;">'antzone'</span>
<span class="linenr"> 2: </span>console.log<span style="color: #AF87FF;">(</span>str0.split<span style="color: #5FD7FF;">(</span><span style="color: #CDC673;">/n/</span><span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span>
<span class="linenr"> 3: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; ["a", "tzo", "e"]</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">str1</span> = <span style="color: #CDC673;">'softwhy is good webSite'</span>
<span class="linenr"> 6: </span>console.log<span style="color: #AF87FF;">(</span>str1.split<span style="color: #5FD7FF;">(</span><span style="color: #CDC673;">/\s/</span><span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; ["softwhy", "is", "good", "webSite"]</span>
<span class="linenr"> 7: </span>console.log<span style="color: #AF87FF;">(</span>str1.split<span style="color: #5FD7FF;">(</span><span style="color: #CDC673;">/\s/</span><span style="color: #5FD7FF;">)</span>, 2<span style="color: #AF87FF;">)</span> <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; ["softwhy", "is"]</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">st2</span> = <span style="color: #CDC673;">'ant'</span>
<span class="linenr">10: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">\w&#21487;&#20197;&#21305;&#37197;&#21040;&#23383;&#31526;&#20018;&#20013;&#30340;&#27599;&#19968;&#20010;&#23383;&#31526;&#65292;&#23383;&#31526;&#20004;&#31471;&#26159;&#31354;</span>
<span class="linenr">11: </span>console.log<span style="color: #AF87FF;">(</span>str.split<span style="color: #5FD7FF;">(</span><span style="color: #CDC673;">/\w/</span><span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; ["", "", "", ""]</span>
<span class="linenr">12: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#22914;&#26524;&#27491;&#21017;&#34920;&#36798;&#24335;&#21253;&#21547;&#23376;&#34920;&#36798;&#24335;&#65292;&#37027;&#20040;&#36820;&#22238;&#30340;&#25968;&#32452;&#20013;&#21253;&#25324;&#19982;&#36825;&#20123;&#23376;&#34920;&#36798;&#24335;&#21305;&#37197;&#30340;&#23383;&#20018;</span>
<span class="linenr">13: </span>console.log<span style="color: #AF87FF;">(</span>str.split<span style="color: #5FD7FF;">(</span><span style="color: #CDC673;">/(\w)/</span><span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">)</span>  <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; ["", "a", "", "n", "", "t", ""]</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc656578" class="outline-2">
<h2 id="orgc656578">元字符</h2>
<div class="outline-text-2" id="text-orgc656578">
<p>
正则表达式是具有一定规则的字符串，组成正则的字符串可以有普通的字符，也可以有特殊字符（元字符）。
</p>

<p>
正则表达式的元字符从形成基本可以分为两大类：
</p>
<ul class="org-ul">
<li>本身就有特殊意义，比如 <code>^、$、.</code> 等；</li>
<li>通过转义字符使其具有特殊意义，如 <code>\w、\d</code> 等。</li>
</ul>

<table>
<caption class="t-above"><span class="table-number">Table 1:</span> 元字符</caption>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">元字符</th>
<th scope="col" class="org-left">结构</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>.</code></td>
<td class="org-left"><code>/.+/</code></td>
<td class="org-left">匹配除回车符 <code>\r</code> 和换行符 <code>\n</code> 外的任意字符</td>
</tr>

<tr>
<td class="org-left"><code>^</code></td>
<td class="org-left"><code>/^x/</code></td>
<td class="org-left">匹配字符串的起始位置</td>
</tr>

<tr>
<td class="org-left"><code>$</code></td>
<td class="org-left"><code>/x$/</code></td>
<td class="org-left">匹配字符串的结尾</td>
</tr>

<tr>
<td class="org-left"><code>\w</code></td>
<td class="org-left"><code>/\w/</code></td>
<td class="org-left">匹配单词字符，等价于 <code>[a-zA-Z0-9]</code></td>
</tr>

<tr>
<td class="org-left"><code>\W</code></td>
<td class="org-left"><code>/\W/</code></td>
<td class="org-left">匹配非字母数字，等价于 <code>[^a-zA-Z0-9]</code></td>
</tr>

<tr>
<td class="org-left"><code>\d</code></td>
<td class="org-left"><code>/\d/</code></td>
<td class="org-left">匹配单个数字字符，等价于 <code>[0-9]</code></td>
</tr>

<tr>
<td class="org-left"><code>\D</code></td>
<td class="org-left"><code>/\D/</code></td>
<td class="org-left">匹配非数字字符，等价于 <code>[^0-9]</code></td>
</tr>

<tr>
<td class="org-left"><code>\s</code></td>
<td class="org-left"><code>/\s/</code></td>
<td class="org-left">匹配空白字符</td>
</tr>

<tr>
<td class="org-left"><code>\S</code></td>
<td class="org-left"><code>/\S/</code></td>
<td class="org-left">匹配非空白字符</td>
</tr>

<tr>
<td class="org-left"><code>\b</code></td>
<td class="org-left"><code>/\b/</code></td>
<td class="org-left">匹配字符的边界，即匹配的是一个位置，而不是一个真正的字符</td>
</tr>

<tr>
<td class="org-left"><code>\B</code></td>
<td class="org-left"><code>/\B/</code></td>
<td class="org-left">匹配非单词边界</td>
</tr>

<tr>
<td class="org-left"><code>\0</code></td>
<td class="org-left"><code>/\0/</code></td>
<td class="org-left">即 <code>null</code> ，等价于 <code>\u0000</code></td>
</tr>
</tbody>
</table>

<p>
其余有： <code>\n \f \r \t \v \xxx \xnn \uxxxx</code> 。
</p>
</div>
</div>

<div id="outline-container-org5d206bd" class="outline-2">
<h2 id="org5d206bd">量词</h2>
<div class="outline-text-2" id="text-org5d206bd">
<table>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">字符</th>
<th scope="col" class="org-left">结构</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>+</code></td>
<td class="org-left"><code>/x+/</code></td>
<td class="org-left">可以重复匹配前面匹配的字符 1 次或多次</td>
</tr>

<tr>
<td class="org-left"><code>*</code></td>
<td class="org-left"><code>/x*/</code></td>
<td class="org-left">可以重复匹配前面匹配的字符 0 次或多次</td>
</tr>

<tr>
<td class="org-left"><code>?</code></td>
<td class="org-left"><code>x?</code></td>
<td class="org-left">可以匹配前面匹配的字符 0 次或 1 次</td>
</tr>

<tr>
<td class="org-left"><code>{n}</code></td>
<td class="org-left"><code>/x{n}/</code></td>
<td class="org-left">可以重复前面匹配的内容 n 次</td>
</tr>

<tr>
<td class="org-left"><code>{n, m}</code></td>
<td class="org-left"><code>/x{n, m}/</code></td>
<td class="org-left">重复前一项匹配至少 n 次，但是不能够超过 m 次</td>
</tr>

<tr>
<td class="org-left"><code>{n,}</code></td>
<td class="org-left"><code>/x{n,}/</code></td>
<td class="org-left">匹配前一项 n 次或者更多次</td>
</tr>

<tr>
<td class="org-left"><code>*?</code></td>
<td class="org-left"><code>/x*?/</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>+?</code></td>
<td class="org-left"><code>/x+?/</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>??</code></td>
<td class="org-left"><code>/x??/</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>{n, m}?</code></td>
<td class="org-left"><code>/x{n, m}?/</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>{n,}?</code></td>
<td class="org-left"><code>/x{n,}?/</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
