org/regular-expression.org
** 修饰符

| 修饰符 | 结构     | 描述                                            |
|--------+----------+-------------------------------------------------|
| =g=    | =/reg/g= | global 执行全局匹配                             |
| =i=    | =/reg/i= | ignore 忽略大小写的区分                         |
| =m=    | =/reg/m= | 执行多行匹配                                    |
| =y=    | =/reg/y= | 正则表达式必须从lastIndex规定的位置开始进行匹配 |

** 分组和选择项

正则表达式中的分组，可以将小括号中的内容作为一个独立整体处理。

正则表达式中，也有选项概念，使用竖杠定义选项，竖杠两侧是具体选项内容，可以一次定义多个选项，比如 =a|b|c|d= 。

** 贪婪匹配和惰性匹配

所谓的贪婪匹配就是在符合规则的条件下，正则表达式尽可能多的匹配内容。

实现贪婪匹配模式的核心是正则表达式重复量词，正是由于它的存在，才有贪婪的可能。

惰性匹配确实比较“懒惰”，它会尽可能少的去匹配字符串中的内容，与正则表达式贪婪匹配恰好相反。
