public/regular-expression.html

<div id="outline-container-org805aa5d" class="outline-2">
<h2 id="org805aa5d">修饰符</h2>
<div class="outline-text-2" id="text-org805aa5d">
<table>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">修饰符</th>
<th scope="col" class="org-left">结构</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>g</code></td>
<td class="org-left"><code>/reg/g</code></td>
<td class="org-left">global 执行全局匹配</td>
</tr>

<tr>
<td class="org-left"><code>i</code></td>
<td class="org-left"><code>/reg/i</code></td>
<td class="org-left">ignore 忽略大小写的区分</td>
</tr>

<tr>
<td class="org-left"><code>m</code></td>
<td class="org-left"><code>/reg/m</code></td>
<td class="org-left">执行多行匹配</td>
</tr>

<tr>
<td class="org-left"><code>y</code></td>
<td class="org-left"><code>/reg/y</code></td>
<td class="org-left">正则表达式必须从lastIndex规定的位置开始进行匹配</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8d3cd34" class="outline-2">
<h2 id="org8d3cd34">分组和选择项</h2>
<div class="outline-text-2" id="text-org8d3cd34">
<p>
正则表达式中的分组，可以将小括号中的内容作为一个独立整体处理。
</p>

<p>
正则表达式中，也有选项概念，使用竖杠定义选项，竖杠两侧是具体选项内容，可以一次定义多个选项，比如 <code>a|b|c|d</code> 。
</p>
</div>
</div>

<div id="outline-container-org9a5f332" class="outline-2">
<h2 id="org9a5f332">贪婪匹配和惰性匹配</h2>
<div class="outline-text-2" id="text-org9a5f332">
<p>
所谓的贪婪匹配就是在符合规则的条件下，正则表达式尽可能多的匹配内容。
</p>

<p>
实现贪婪匹配模式的核心是正则表达式重复量词，正是由于它的存在，才有贪婪的可能。
</p>

<p>
惰性匹配确实比较“懒惰”，它会尽可能少的去匹配字符串中的内容，与正则表达式贪婪匹配恰好相反。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-05-21 Thu 15:59</p>
<p class="author">Author: Jack Liu</p>
<p class="date">Created: 2020-05-21 Thu 21:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
